<?php
echo ' 要件定義(要求仕様書)';
//エンドユーザー (お客様) が実現したい機能を、システム的にまとめることを言います
//要件定義書は、システムを理解しているＳＥがシステム的に要件をまとめるます。 また、要件定義で作成した成果物、ドキュメントのことを要件定義書と言います
echo '<br>';
echo '単体テスト・結合テスト';
//単体テスト
//プログラムを作成した後に最初に行うテストであり、比較的小さな単位で行うテストのことを言います
//関数やメソッドの単位で行われます。
//結合テスト
//さまざまな観点のテストの目的（テストタイプ）で実施できることから、プロジェクトの中盤から終盤にかけて長い期間で実施されます
//コンポーネントテストを実施した後に実行されるテストです
echo '<br>';
echo 'テスト仕様書(どのようなもの、項目)';
//システムやソフトウェアが、クライアントのヒアリングをもとに作り上げた要件定義書の通りに機能するかどうか、テストするポイントをまとめたドキュメント
//１．どんな条件の元で２．どんなデータを入れると３．どんな処理がされて４．どんな結果になるはず５．その結果から何が確認できる
//どんなテストをするかまとめた資料
