<?php
echo  "PostgreSQL・Oracle SQL" ;
//Postgres オブジェクトリレーショナルデータベース（ORDBMS）であり、テーブルの継承や関数のオーバーロードなどの機能を備えています
//(続き)リレーショナルデータベース （RDB）の作成や操作、管理ができる オープンソース の データベース管理システム
//Oracle データベースでSQLを使ってテーブルを作成し、レコードの検索、登録、更新、削除ができるデータベース言語
//２つの違い → ユーザーとスキーマは同義です。それに対し、PostgreSQLでは、ユーザーとスキーマは分離しています
//スキーマ自体を作成することはできません。 ユーザーに関連付けられています。
//ユーザーはデータベースへの接続に使用するアカウントであり、スキーマはそのアカウントに属するオブジェクト（テーブル、ビューなど）のセットであると考えることができま。
echo '<br>';
echo "TortoiseGit・TortoiseSVN" ;
//TortoiseGit Gitをより扱いやすくするために開発されたWindows用ソフトウェア
//TortoiseSVN  フリーソフトウェアのバージョン管理システムです
//Windowsエクスプローラと統合しているため、ファイルやディレクトリを容易に確認することが可能です
echo '<br>';
echo "外部設計・内部設計" ;
//外部設計 ソフトウェアや情報システムの開発工程の一つで、外部から見たシステムの仕様を定義する工程
//方法論の違いにより、この工程のことを「 基本設計 」あるいは「概要設計」と呼ぶ場合もある
//内部設計 ソフトウェアや情報システムの開発工程の一つで、全体の構成や行うべき処理の詳細など実装に必要な仕様を定義する工程
//方法論の違いにより、この工程を「 機能設計 」あるいは「 詳細設計 」と呼ぶ場合もある。
?>